## Условия задач

### A. Оставить различные

Дан массив _a_ из _n_ целых чисел. Напишите программу, которая выведет:
1. исходный список чисел без дубликатов с сохранением порядка;
2. количество чисел, которые были удалены из массива.

**Формат входных данных**

В первой строке число _n_ (1 ≤ _n_ ≤ 100000). Во второй строке записаны _n_ целых чисел _a_i_ (1 ≤ _a_i_ ≤ 10000).

**Формат результата**

Выведите в первой строке список уникальных чисел. Во второй строке число удаленных элементов.

**Примеры**

Входные данные
```
3
3 3 3
```
Результат работы
```
3
2
```

Входные данные
```
5
5 5 5 4 4
```
Результат работы
```
5 4
3
```

Входные данные
```
10
7 10 3 2 7 4 8 5 9 10
```
Результат работы
```
7 10 3 2 4 8 5 9
2
```

### B. Сложная сортировка

Дан массив _a_1, ..., a_n_ из _n_ натуральных чисел.

Требуется отсортировать числа в массиве в порядке возрастания суммы цифр, а при равной сумме цифр -- по возрастанию самого числа.

**Формат входных данных**

В первой строке задается число n (3 ≤ _n_ ≤ 1000).

Во второй -- задаются _n_ натуральных чисел _a_1, ..., a_n_ через пробел (0 ≤ _a_k_ ≤ 1000).

**Формат результата**

Выведите отсортированный список чисел через пробел.

**Примеры**

Входные данные
```
3
14 23 22
```
Результат работы
```
22 14 23
```

Входные данные
```
3
13 22 4
```
Результат работы
```
4 13 22
```

**Примечания**

Вспомните, как упорядочиваются кортежи (tuple) между собой. Для сортировки списков используйте функцию sorted, обратите внимание на аргумент key.

### C. Сдача в магазине "Фикси"

Представьте, что вы кассир в популярной сети продовольственных магазинов "Фикси". И вам нужно вернуть как можно более неудобным способом сдачу, собранную только монетами. При этом сдачу нужно вернуть минимальным количеством монет. В вашем распоряжении имеются монеты номиналом в 1, 5, 10 и 50 копеек и 1, 2, 5 и 10 руб.

**Формат входных данных**

На вход вашей программе подается неотрицательное число _N_ -- сумма сдачи в формате `'%.2f'`.

**Формат результата**

Выведите список монет, которые должен выдать кассир: номинал монеты и количество монет, разделенных символом **табуляции**.

Порядок монет идет в соответствии с уменьшением их номинала. Номинал монеты печатается в рублях в формате `'%5.2f'`.

**Примеры**

Входные данные
```
74.90
```
Результат работы
```
10.00	7
 2.00	2
 0.50	1
 0.10	4
```

Входные данные
```
0.00
```
Результат работы
```
```

### D. Сумма конкатенаций

На стандартный поток ввода подаются два числа _N_ и _K_. Напишите программу, которая по заданным числам вычисляет число: _N_ + _NN_ + _NNN_ + _..._ + _N...N_, где _N...N_ -- число, составленное конкатенацией _K_ раз числа _N_.

**Формат входных данных**

На вход вашей программе подаются два целых неотрицательных числа _N_ и _K_, где _N_ -- число, которое нужно повторить _K_ раз. Числа разделены пробелом.

**Формат результата**

Выведите получившееся число.

**Примеры**

Входные данные
```
28 4
```
Результат работы
```
28568512
```

Входные данные
```
3 1
```
Результат работы
```
3
```

Входные данные
```
3 0
```
Результат работы
```
0
```

### E. Анаграммы

Анаграмма -- это слово или фраза, образованные из букв другого слова или фразы путем перестановки. Напишите программу, которая найдет все анаграммы образованные из одинакового набора букв.

**Формат входных данных**

На вход вашей программе подается число _N_ (число слов). Далее идет список слов, каждая слово идет на новой строке.

**Формат результата**

Выведите сгруппированный список анаграмм: каждая строка содержит список слов из одних и тех же букв. Слова разделены пробелом.

Порядок слов в строке и порядок строк не важны.

**Примеры**

Входные данные
```
7
немка
немота
манекен
монета
каприз
приказ
отмена
```
Результат работы
```
немка
немота монета отмена
манекен
каприз приказ
```

Входные данные
```
8
meal
astronomer
below
lame
silent
listen
elbow
male
```
Результат работы
```
meal lame male
astronomer
below elbow
silent listen
```

### F. Анаграммы 2.0: Предложения

На вход программе подаются два предложения, каждое предложение начинается с новой строки. Необходимо проверить, можно ли получить второе предложения из первого с помощью перестановки и удаления слов. Если такое возможно, напечатайте YES, в противном случае -- NO.

**Примеры**

Входные данные
```
Вопросов всегда больше чем ответов
Ответов всегда больше чем вопросов
```
Результат работы
```
YES
```

Входные данные
```
Вопросов всегда больше чем ответов
Вопросов всегда больше
```
Результат работы
```
YES
```

Входные данные
```
Вопросов всегда больше чем ответов
Ответов всегда меньше чем вопросов
```
Результат работы
```
NO
```

### I. Загадка

Загадано натуральное число _x_ от 1 до 100000 (оба числа включены). Вам нужно написать программу, отгадывающую это число.

Программа может задавать вопросы вида "Верно ли, что _x_ < _a_?" для различных _a_, но ответы на эти вопросы она получает не сразу.

Вопросы задаются раундами -- в одном раунде можно задать произвольное количество вопросов и по окончании раунда получить ответы на все эти вопросы. Используются следующие операторы:
*  ? a -- задать вопрос
*  + -- подтвердить список вопросов
*  ! a -- назвать финальный ответ

За каждый вопрос нужно заплатить 1 монету, за каждый раунд 10 монет. Нужно привести алгоритм, который отгадает число _x_, заплатив не больше чем 100 монет.

**Формат входных данных**

Это интерактивная задача. Тестируемой программе не подается никаких входных данных.

**Примеры**

Входные данные
```
```
**Результат работы**
```
? 2
? 4
? 6
+
0 # ответ программы интерактора
0 # ответ программы интерактора
1 # ответ программы интерактора
? 5
+
0 # ответ программы интерактора
! 5
```

**Примечания**

Вы получите вердикт **Неправильный ответ (Wrong Answer)**, если:
* вы потратили строго больше 100 монет;
* итоговый ответ не является правильным.

Вы получите вердикт **Неправильный формат вывода (Presentation Error)**, если:
* вопрос или ответ не соответствует описанному выше формату;
* параметр _a_ в вашем запросе меньше 1 или больше 100000.

Вы получите вердикт **Превышено реальное время работы (Time Limit Exceeded)**, если:
* не будете ничего выводить;
* забудете сбросить буфер после какого-нибудь вывода.

В Python сбросить буфер можно одним из способов.
```py
# способ 1
print("Hello world!", flush=True)

# способ 2
import sys
print("Hello world!")
sys.stdout.flush()
```

За вывод ответа платить не нужно.

В некоторых случаях система может возвращать некорректный ответ, например, **Ошибка выполнения (Run-time error)** вместо одного из вердиктов выше. Поэтому для отладки ваших программ рекомендуется использовать функцию `safe_input()` вместо `input()`. Функция `safe_input()` выглядит следующим образом:
```py
import sys

def safe_input():
    try:
        return input()
    except EOFError:
        sys.exit(0)
```

Функцию выше нужно поместить в файл с вашим кодом.

Олимпиада "Я -- профессионал". Направление "Искусственный интеллект". Очный этап. 2019 г.
